# Index Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctFittingAndAccessoryConnectorData..::..Index Property
DuctFittingAndAccessoryConnectorData Class See Also
---
return the index of this connector
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public int Index { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Index As Integer
	Get
```

Visual C++
---
```text
public:
property int Index {
	int get ();
}
```

# See Also
DuctFittingAndAccessoryConnectorData Class
Autodesk.Revit.DB.Mechanical Namespace